## CREATE

만드는 방법에 대해서 설명합니다

####  Database

- 데이터 베이스 생성 문법 

    sql> CREATE DATABASE test;


- 데이터 베이스 선택 문법 

    sql> USE test;


- 현재 데이터 베이스 확인

    sql> SELECT DATABASE();

#### Table

- 테이블 생성
 
```
    sql> CREATE TABLE table_name (
         column_name_1 column_data_type_1 column_constraint_1,     
         column_name_2 column_data_type_2 column_constraint_2 ... )
```

## ALTER 

수정하는 방법에 대해서 설명합니다.

#### Database

- test 데이터 베이스의 문자열 인코딩을 ascii로 변경

    sql> ALTER DATABASE test CHARACTER SET = ascii;

#### Table

- MODIFY : user2 테이블에 INT(3) 데이터 타입을 갖는 tmp 컬럼으로 수정

    sql> ALTER TABLE user2 MODIFY COLUMN tmp INT(3);

## DROP

#### Database

- 데이터 베이스 삭제

    sql> DROP DATABASE tmp;
    
    sql> SHOW DATABASES;

#### Table
- 테이블 삭제
    
    sql> DROP TABLE tmp;

## INSERT

테이블 이름 뒤에 오는 컬럼이름은 생략이 가능하며 대신에 VALUES 뒤에 value 값이 순서대로 와야 합니다.

```
sql> INSERT INTO table_name(column_name_1, column_name_2, ...)
     VALUES(value_1, value_2, ...)
```

## SELECT

#### basic

- 전체 컬럼 데이터 조회

```
sql> SELECT *
     FROM user1
```

#### ALIAS

alias(as)를 이용하여 컬럼명을 변경할수 있습니다. as는 생략이 가능합니다.

```
sql> SELECT user_id as "아이디", name as "이름", rdate as "등록일"
     FROM user1
 ```

#### DISTINCT

DISTINCT를 이용하여 특정 컬럼의 중복 데이터를 제거할수 있습니다.

```
sql> SELECT DISTINCT(name)
     FROM user1
 ```

#### WHERE

WHERE절을 이용해서 검색 조건을 추가할수 있습니다. WHERE절에는 AND, OR, 연산자 등의 기능을 사용할 수 있습니다.

```
sql> SELECT *
     FROM user1
     WHERE age >= 30
     
sql> SELECT *
     FROM user1
     WHERE rdate BETWEEN "2010-01-01" AND "2017-12-13"
```

####  ORDER BY

특정 컬럼으로 데이터 정렬이 가능합니다

```
sql> SELECT *
     FROM user1
     ORDER BY age DESC
     
     
# age로 내림차순 정렬하고 rdate를 오름차순 정렬
sql> SELECT *
     FROM user1
     ORDER BY age DESC, rdate
 ```

#### CONCAT

select한 데이터를 합쳐서 새로운 컬럼으로 보여주는 것이 가능합니다.

```
sql> SELECT email, CONCAT(name, "(", age, ")") AS "name_age"
     FROM user1
```

#### LIKE

```
# email에 gmail이 들어간 데이터 조회
sql> SELECT *
     FROM user1
     WHERE email LIKE "%gmail%"
     
# email에 gmail이 들어가지 않는 데이터 조회
sql> SELECT *
     FROM user1
     WHERE email NOT LIKE "%gmail%"
```

#### IN

WHERE 절의 조건을 여러개 사용하는것을 간단하게 만들수 있습니다.

```
sql> SELECT *
     FROM user1
     WHERE name="peter" OR name="alice"
```

#### LIMIT

LIMIT은 조회하는 데이터의 수를 제한할수 있습니다.

```
# user1 테이블에서 두번째에서 네번째까지의 3개의 데이터 조회
sql> SELECT *
     FROM user1
     LIMIT 1,3
```

## UPDATE

특정 조건에 맞는 데이터를 수정할수 있습니다.

```
sql> UPDATE <table_name>
     SET <column_name_1> = <value_1>, <column_name_2> = <value_2>,
     WHERE <condition>
```

## DELETE

특정 조건에 맞는 데이터를 삭제할수 있습니다.

```
sql> DELETE FROM <table_name>
     WHERE <condition>
```

## GROUP

#### GROUP BY

여러개의 동일한 데이터를 가지는 특정 컬럼을 합쳐주는 역할을 하는 명령입니다.

- COUNT

```
# city 테이블의 CountryCode를 묶고 각 코드마다 몇개의 데이터가 있는지 확인
sql> SELECT CountryCode, COUNT(CountryCode)
     FROM city
     GROUP BY CountryCode

# countrylanguage 테이블에서 전체 언어가 몇개 있는지 구하시오.
sql > SELECT COUNT(DISTINCT(Language)) as language_count
     FROM countrylanguage
 ```

- MAX

```
# 대륙별 인구수와 GNP 최대 값을 조회
sql> SELECT continent, MAX(Population) as Population, MAX(GNP) as GNP
     FROM country
     GROUP BY continent
 ```

- MIN

```
# 대륙별 인구수와 GNP 최소 값을 조회 (GNP와 인구수가 0이 아닌 데이터 중에서)
sql> SELECT continent, MIN(Population) as Population, MIN(GNP) as GNP
     FROM country
     WHERE GNP != 0 AND Population != 0
     GROUP BY continent
```

- SUM

```
# 대륙별 총 인구수와 총 GNP
sql> SELECT continent, SUM(Population) as Population, SUM(GNP) as GNP
     FROM country
     WHERE GNP != 0 AND Population != 0
     GROUP BY continent
 ```

-  AVG

```
# 대륙별 평균 인구수와 평균 GNP 결과를 인구수로 내림차순 정렬
sql> SELECT continent, AVG(Population) as Population, AVG(GNP) as GNP
     FROM country
     WHERE GNP != 0 AND Population != 0
     GROUP BY continent
     ORDER BY Population DESC

```

#### HAVING

GROUP BY에서 반환되는 결과에 조건을 줄수 있습니다.

```
# 대륙별 전체인구를 구하고 5억이상인 대륙만 조회
sql> SELECT continent, SUM(Population) as Population
     FROM country
     GROUP BY continent
     HAVING Population > 500000000
     
     
# 대륙별 평균 인구수, 평균 GNP, 1인당 GNP한 결과를 1인당 GNP가 0.01 이상인 데이터를 조회하고 1인당GNP를 내림차순으로 정렬
sql> SELECT continent, AVG(Population) as Population, AVG(GNP) as GNP,
     AVG(GNP) / AVG(Population) * 1000 as AVG
     FROM country
     WHERE GNP != 0 AND Population != 0
     GROUP BY continent
     HAVING AVG > 0.01
     ORDER BY AVG DESC
 ```